# SketchPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Sketch..::..SketchPlane Property
Sketch Class See Also
---
Returns the Sketch Plane of the Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SketchPlane SketchPlane { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SketchPlane As SketchPlane
	Get
```

Visual C++
---
```text
public:
property SketchPlane^ SketchPlane {
	SketchPlane^ get ();
}
```

# Remarks
This property is used to retrieve the Sketch Plane of Sketch.
# See Also
Sketch Class
Autodesk.Revit.DB Namespace